IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CPSW0_CPSW0.xml
<module name="CPSW0_CPSW0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CPSW0_CPSW_NUSS_IDVER_REG" acronym="CPSW0_CPSW_NUSS_IDVER_REG" offset="0x0" width="32" description="">
		<bitfield id="IDENT" width="16" begin="31" end="16" resetval="0x27552" description="Identification value" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x3" description="RTL version value" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR_VER" width="3" begin="10" end="8" resetval="0x1" description="Major version value" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="MINOR_VER" width="8" begin="7" end="0" resetval="0x3" description="Minor version value" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CPSW0_SS_SYNCE_COUNT_REG" acronym="CPSW0_SS_SYNCE_COUNT_REG" offset="0x4" width="32" description="">
		<bitfield id="SYNCE_CNT" width="32" begin="31" end="0" resetval="0x0" description="Sync E Count Value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CPSW0_SS_SYNCE_MUX_REG" acronym="CPSW0_SS_SYNCE_MUX_REG" offset="0x8" width="8" description="">
		<bitfield id="SYNCE_SEL" width="6" begin="5" end="0" resetval="0x0" description="Sync E Select Value" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="CPSW0_SS_CONTROL_REG" acronym="CPSW0_SS_CONTROL_REG" offset="0xC" width="8" description="">
		<bitfield id="EEE_PHY_ONLY" width="1" begin="1" end="1" resetval="0x0" description="Energy Efficient Enable Phy Only Mode: 0=The low power indicate state includes gating off the CPPI_GCLK to the CPSW, 1=The low power indicate state does not gate the clock to the CPSW" range="1" rwaccess="RW"/> 
		<bitfield id="EEE_EN" width="1" begin="0" end="0" resetval="0x0" description="Energy Efficient Ethernet Enable: 0=EEE is disabled, 1=EEE is enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CPSW0_SS_INT_CONTROL_REG" acronym="CPSW0_SS_INT_CONTROL_REG" offset="0x18" width="32" description="">
		<bitfield id="INT_TEST" width="1" begin="31" end="31" resetval="0x0" description="Interrupt Test" range="31" rwaccess="RW"/> 
		<bitfield id="INT_SEL_VEC_EN" width="1" begin="30" end="30" resetval="0x0" description="Interrupt Sel Vector Enable" range="30" rwaccess="RW"/> 
		<bitfield id="INT_BYPASS" width="6" begin="21" end="16" resetval="0x0" description="Interrupt Bypass   Value" range="21 - 16" rwaccess="RW"/> 
		<bitfield id="INT_PRESCALE" width="12" begin="11" end="0" resetval="0x0" description="Interrupt Prescale Value" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CPSW0_SS_STATUS_REG" acronym="CPSW0_SS_STATUS_REG" offset="0x1C" width="0" description="">
		<bitfield id="EEE_CLKSTOP_ACK" width="1" begin="0" end="0" resetval="0x0" description="Energy Efficient Ethernet clockstop acknowledge from CPSW" range="0" rwaccess="RO"/>
	</register>
	<register id="CPSW0_SUBSYSTEM_CONFIG_REG" acronym="CPSW0_SUBSYSTEM_CONFIG_REG" offset="0x20" width="32" description="">
		<bitfield id="XGMII" width="8" begin="27" end="20" resetval="0x0" description="The Number of XGMII Ports included in the CPSW_NUSS" range="27 - 20" rwaccess="RO"/> 
		<bitfield id="QSGMII" width="1" begin="19" end="19" resetval="0x0" description="QSGMII is included in the CPSW_NUSS" range="19" rwaccess="RO"/> 
		<bitfield id="SGMII" width="1" begin="18" end="18" resetval="0x0" description="SGMII  is included in the CPSW_NUSS" range="18" rwaccess="RO"/> 
		<bitfield id="RGMII" width="1" begin="17" end="17" resetval="0x1" description="RGMII  is included in the CPSW_NUSS" range="17" rwaccess="RO"/> 
		<bitfield id="RMII" width="1" begin="16" end="16" resetval="0x1" description="RMII   is included in the CPSW_NUSS" range="16" rwaccess="RO"/> 
		<bitfield id="NUM_GENF" width="5" begin="12" end="8" resetval="0x2" description="The number of CPTS GENF outputs" range="12 - 8" rwaccess="RO"/> 
		<bitfield id="NUM_PORTS" width="8" begin="7" end="0" resetval="0x3" description="The total number of ports including the host port 0" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CPSW0_RGMII1_STATUS_REG" acronym="CPSW0_RGMII1_STATUS_REG" offset="0x30" width="8" description="">
		<bitfield id="FULLDUPLEX" width="1" begin="3" end="3" resetval="0x0" description="Rgmii1 full dulex: 0=Half-duplex, 1=Full-duplex" range="3" rwaccess="RO"/> 
		<bitfield id="SPEED" width="2" begin="2" end="1" resetval="0x0" description="Rgmii1 speed: 00=10Mbps, 01=100Mbps, 10=1000Mbps, 11=reserved" range="2 - 1" rwaccess="RO"/> 
		<bitfield id="LINK" width="1" begin="0" end="0" resetval="0x0" description="Rgmii1 link indicator:   0=Link is down, 1=Link is up" range="0" rwaccess="RO"/>
	</register>
	<register id="CPSW0_RGMII2_STATUS_REG" acronym="CPSW0_RGMII2_STATUS_REG" offset="0x34" width="8" description="">
		<bitfield id="FULLDUPLEX" width="1" begin="3" end="3" resetval="0x0" description="Rgmii2 full dulex: 0=Half-duplex, 1=Full-duplex" range="3" rwaccess="RO"/> 
		<bitfield id="SPEED" width="2" begin="2" end="1" resetval="0x0" description="Rgmii2 speed: 00=10Mbps, 01=100Mbps, 10=1000Mbps, 11=reserved" range="2 - 1" rwaccess="RO"/> 
		<bitfield id="LINK" width="1" begin="0" end="0" resetval="0x0" description="Rgmii2 link indicator:   0=Link is down, 1=Link is up" range="0" rwaccess="RO"/>
	</register>
</module>